
# パラメーターの設定ファイル



# シフト開始時間と終了時間
store_opentime = '9:00'
store_closetime = '22:00'


Worker = [
  ('吉田','17:00','22:00','0'),
  ('佐々木','17:15','22:00','8'),
  ('日置','9:00','12:00','6'),
  ('星田','16:00','21:30','3'),
  ('平島','16:00','21:30','3'),
  ('赤木','9:00','18:00','3'),
  ('宮城','13:00','22:00','3'),
  ('瀬間','14:30','22:15','3'),
]
worker_name = 0
work_start_time = 1
work_end_time = 2
work_weight = 3

Job = [
  ('1','レジ','1','10','9:00','22:00'),
  ('2','サッカー','2','9','10:00','22:00'),
  ('3','食レジ応援','1','11','21:00','22:00'),
  ('4','発注','1','6','17:00','22:00'),
]
job_id = 0
job_name = 1
required_number = 2
priority = 3
job_start_time = 4
job_end_time = 5


Specialjob = [
  ('1','meating','赤木','12:00','12:30'),
  ('2','レジ応援','吉田','18:00','19:00'),

]
spjob_id = 0
spjob_name = 1
spwoker_name = 2
spjob_start_time = 3
spjob_end_time = 4

